## Part1

In [7]:
import pandas as pd

In [6]:
import numpy as np

In [8]:
from numpy.random import randn

In [9]:
np.random.seed(101)

In [10]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [11]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
seriesX = df['X'] #case sensitive
seriesX

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [15]:
type(seriesX)

pandas.core.series.Series

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df.W #alternative to In14

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [18]:
df[['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [21]:
df['YZ'] = df['Y']*df['Z']

In [22]:
df

          W         X         Y         Z        YZ
A  2.706850  0.628133  0.907969  0.503826  0.457458
B  0.651118 -0.319318 -0.848077  0.605965 -0.513905
C -2.018168  0.740122  0.528813 -0.589001 -0.311471
D  0.188695 -0.758872 -0.933237  0.955057 -0.891294
E  0.190794  1.978757  2.605967  0.683509  1.781202

In [24]:
df.drop('YZ', axis=1, inplace=True) #column=axis1, rows = axis0

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [29]:
df.shape

(5, 4)

In [30]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [31]:
df.iloc[2] #index based location

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [32]:
df.loc['C','Y']

0.5288134940893595

In [33]:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [36]:
df.loc['A':'C']

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

## Part 2

In [38]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [48]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [50]:
#multiple conditions
df[(df['Y']>0) & (df['Y']>1)]

#and=& or=|

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df[(df['Y']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [53]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Part 3

In [66]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [67]:
df2 = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [68]:
df2

             A         B
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [69]:
df2.loc['G1']

          A         B
1  1.025984 -0.156598
2 -0.031579  0.649826
3  2.154846 -0.610259

In [70]:
df2.loc['G1'].loc[1]

A    1.025984
B   -0.156598
Name: 1, dtype: float64

In [72]:
#naming
df2.index.names = ['parent', 'child']

In [73]:
df2

                     A         B
parent child
G1     1      1.025984 -0.156598
       2     -0.031579  0.649826
       3      2.154846 -0.610259
G2     1     -0.755325 -0.346419
       2      0.147027 -0.479448
       3      0.558769  1.024810

In [75]:
df2.loc['G1']

              A         B
child
1      1.025984 -0.156598
2     -0.031579  0.649826
3      2.154846 -0.610259

In [77]:
df2.loc['G1'].loc[1]

A    1.025984
B   -0.156598
Name: 1, dtype: float64

In [78]:
df2.loc['G1'].loc[1]['B']

-0.1565979042889875

In [80]:
#using xs - Cross Section
df2.xs('G1')

              A         B
child
1      1.025984 -0.156598
2     -0.031579  0.649826
3      2.154846 -0.610259

In [82]:
df2.xs(1, level='child')

               A         B
parent
G1      1.025984 -0.156598
G2     -0.755325 -0.346419